Личный_помощник/src/InformationRegisters/ФиксированныеСуммыОплатыКоммунальныхУслуг/ФиксированныеСуммыОплатыКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФиксированныеСуммыОплатыКоммунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/InformationRegisters/ФиксированныеСуммыОплатыКоммунальныхУслуг/ManagerModule.bsl
Функция ПолучитьСуммыОплаты(Знач Услуги = Неопределено, Знач Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФиксированныеСуммыОплатыКоммунальныхУслуг.Сумма,
		|	ФиксированныеСуммыОплатыКоммунальныхУслуг.ВидУслуги
		|ИЗ
		|	РегистрСведений.ФиксированныеСуммыОплатыКоммунальныхУслуг.СрезПоследних(&Дата, ВидУслуги В (&Услуги)) КАК ФиксированныеСуммыОплатыКоммунальныхУслуг";
		
	Если Не ЗначениеЗаполнено(Услуги) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидУслуги В (&Услуги)", "");		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуги", Услуги);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
